{
  "class_name": "Sequential",
  "config": {
    "name": "sequential_1",
    "layers": [
      {
        "class_name": "Embedding",
        "config": {
          "input_dim": 300,
          "output_dim": 64,
          "embeddings_initializer": {
            "class_name": "RandomUniform",
            "config": {
              "minval": -0.05,
              "maxval": 0.05,
              "seed": null
            }
          },
          "embeddings_regularizer": null,
          "activity_regularizer": null,
          "embeddings_constraint": null,
          "mask_zero": null,
          "input_length": 150,
          "name": "embedding_Embedding1",
          "trainable": true,
          "batch_input_shape": [
            null,
            150
          ]
        }
      },
      {
        "class_name": "LSTM",
        "config": {
          "name": "lstm_LSTM1",
          "trainable": true,
          "units": 128,
          "activation": "tanh",
          "recurrent_activation": "hard_sigmoid",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "scale": 1,
              "mode": "fan_avg",
              "distribution": "normal",
              "seed": null
            }
          },
          "recurrent_initializer": {
            "class_name": "Orthogonal",
            "config": {
              "gain": 1,
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "unit_forget_bias": null,
          "kernel_regularizer": null,
          "recurrent_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "recurrent_constraint": null,
          "bias_constraint": null,
          "dropout": 0,
          "recurrent_dropout": 0,
          "implementation": null,
          "return_sequences": true,
          "return_state": false,
          "go_backwards": false,
          "stateful": false,
          "unroll": false
        }
      },
      {
        "class_name": "LSTM",
        "config": {
          "name": "lstm_LSTM2",
          "trainable": true,
          "units": 128,
          "activation": "tanh",
          "recurrent_activation": "hard_sigmoid",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "scale": 1,
              "mode": "fan_avg",
              "distribution": "normal",
              "seed": null
            }
          },
          "recurrent_initializer": {
            "class_name": "Orthogonal",
            "config": {
              "gain": 1,
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "unit_forget_bias": null,
          "kernel_regularizer": null,
          "recurrent_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "recurrent_constraint": null,
          "bias_constraint": null,
          "dropout": 0,
          "recurrent_dropout": 0,
          "implementation": null,
          "return_sequences": true,
          "return_state": false,
          "go_backwards": false,
          "stateful": false,
          "unroll": false
        }
      },
      {
        "class_name": "Dense",
        "config": {
          "units": 300,
          "activation": "softmax",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "scale": 1,
              "mode": "fan_avg",
              "distribution": "normal",
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null,
          "name": "dense_Dense1",
          "trainable": true
        }
      }
    ]
  },
  "keras_version": "tfjs-layers 4.22.0",
  "backend": "tensor_flow.js",
  "weightsManifest": [
    {
      "paths": [
        "weights.bin"
      ],
      "weights": [
        {
          "name": "embedding_Embedding1/embeddings",
          "shape": [
            300,
            64
          ],
          "dtype": "float32"
        },
        {
          "name": "lstm_LSTM1/kernel",
          "shape": [
            64,
            512
          ],
          "dtype": "float32"
        },
        {
          "name": "lstm_LSTM1/recurrent_kernel",
          "shape": [
            128,
            512
          ],
          "dtype": "float32"
        },
        {
          "name": "lstm_LSTM1/bias",
          "shape": [
            512
          ],
          "dtype": "float32"
        },
        {
          "name": "lstm_LSTM2/kernel",
          "shape": [
            128,
            512
          ],
          "dtype": "float32"
        },
        {
          "name": "lstm_LSTM2/recurrent_kernel",
          "shape": [
            128,
            512
          ],
          "dtype": "float32"
        },
        {
          "name": "lstm_LSTM2/bias",
          "shape": [
            512
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_Dense1/kernel",
          "shape": [
            128,
            300
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_Dense1/bias",
          "shape": [
            300
          ],
          "dtype": "float32"
        }
      ]
    }
  ]
}